# ── Shell & navigation ──────────────────
brew "stow"           # symlink manager for dotfiles
brew "zsh"
brew "fzf"            # fuzzy finder
brew "zoxide"         # smart cd with frecency
brew "fd"             # fast find, respects .gitignore

# ── Modern CLI replacements ──────────────
brew "bat"            # cat with syntax highlighting
brew "eza"            # ls with icons, git status
brew "ripgrep"        # grep replacement (rg)
brew "delta"          # better git diffs

# ── Dev tools ───────────────────────────
brew "neovim"
brew "gh"             # GitHub CLI
brew "jq"             # JSON processor
brew "tree"           # directory tree viewer

# ── Optional — uncomment as needed ───────
# brew "tmux"
# brew "wget"
# brew "httpie"         # curl alternative
# brew "tldr"           # practical man pages
# brew "hyperfine"      # command benchmarking
# brew "glow"           # markdown in the terminal

# ── Formatters (used by conform.nvim) ────
brew "stylua"         # Lua formatter
brew "shfmt"          # shell formatter

# ── Mac App Store ─────────────────────────
# mas "Xcode", id: 497799835
