# ── Homebrew Extensions ──────────────────
tap "homebrew/bundle"
tap "homebrew/services"

# ── Shell & navigation ───────────────────
brew "stow"           # symlink manager for dotfiles
brew "zsh"
brew "fzf"            # fuzzy finder
brew "zoxide"         # smart cd with frecency
brew "fd"             # fast find, respects .gitignore

# ── Modern CLI replacements ──────────────
brew "topgrade"
brew "starship"
brew "ripgrep"
brew "bottom"
brew "git"
brew "ripgrep"        # grep replacement (rg)

# ── Dev tools ────────────────────────────
brew "neovim"
brew "gh"             # GitHub CLI

# ── Runtimes ─────────────────────────────
brew "uv"
brew "ruff"
brew "duckdb"
brew "bun"
brew "rustup"
brew "biome"

# ── Applications ─────────────────────────
# cask "zed"
# cask "ghostty"
# cask "beekeeper-studio"

# cask "raycast"
# cask "pearcleaner"
# cask "espanso"
# cask "localsend"

# cask "proton-pass"
# cask "telegram"
# cask "discord"
